app/controllers/surveys_controller.rb

	def index
		@surveys = Survey.all
---
SELECT * FROM "surveys"

	def show
		@survey = Survey.find(params[:id])
		@layout = Layout.find(@survey.layout_id)
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 5)
SELECT * FROM "layouts" WHERE ("layouts"."id" = 1)

	def new
		@survey = Survey.new
		@layouts = Layout.all
---
SELECT * FROM "layouts"

	def create
		@survey = Survey.new(params[:survey])
		if @survey.save
---
INSERT INTO "surveys" ("auth_key", "title", "owner_mail", "description", "layout_id") VALUES('plplpl', 'Nowa', 'wp.@wp.pl', NULL, 1)

	def edit
		@survey = Survey.find(params[:id])
		@layouts = Layout.all
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 13)
SELECT * FROM "layouts"

	def update
		@survey = Survey.find(params[:id])
		if @survey.update_attributes(params[:survey])
---
SELECT * FROM "surveys" WHERE ("surveys"."id" = 13)
UPDATE "surveys" SET "title" = 'Ankieta 12', "owner_mail" = 'email1@wp.pl' WHERE "id" = 3

	def delete
		Survey.find(params[:id]).destroy
---
DELETE FROM "surveys" WHERE "id" = 13
SELECT * FROM "surveys" WHERE ("surveys"."id" = 13)